app/controllers/editions_controller.rb

  def show
    @edition  = Edition.find(params[:id])
    @poets    = @edition.contributors.all(:conditions => ["work_type = ?", 'poetry'])
    @prosers  = @edition.contributors.all(:conditions => ["work_type = ?", 'prose'])
    @reviews  = @edition.works.all(:conditions => "work_type = 'review'")
---
SELECT * FROM `editions` WHERE (`editions`.`id` = 1)
SELECT * FROM `works` WHERE (`works`.edition_id = 1)