app/controllers/editions_controller.rb

SELECT * FROM `editions`
---
  def index
    @editions = Edition.all