app/controllers/editions_admin_controller.rb

SELECT * FROM `editions`
---
  def index
    @editions = Edition.all

SELECT * FROM `editions` WHERE (`editions`.`id` = 1)
---
  def show
    @edition = Edition.find(params[:id])

SELECT * FROM `editions` WHERE (`editions`.`id` = 1)
---
  def edit
    @edition = Edition.find(params[:id])