app/controllers/links_controller.rb

SELECT * FROM `links`
---
  def index
    @links = Link.all