app/controllers/links_admin_controller.rb

SELECT * FROM `links`
---
  def index
    @links = Link.all

SELECT * FROM `links` WHERE (`links`.`id` = 2)
---
  def show
    @link = Link.find(params[:id])

INSERT INTO `links` (`updated_at`, `title`, `description`, `link_url`, `created_at`) VALUES('2009-08-17 10:19:48', 'This is a link', 'How I love this', 'www.google.com', '2009-08-17 10:19:48')
---
  def create
    @link = Link.new(params[:link])

    respond_to do |format|
      if @link.save

SELECT * FROM `links` WHERE (`links`.`id` = 2)
DELETE FROM `links` WHERE `id` = 2
---
  def destroy
    @link = Link.find(params[:id])
    @link.destroy