app/controllers/public_controller.rb

  def index
    @edition  = Edition.first(:order => 'publish_date DESC')
    @poets    = @edition.contributors.all(:conditions => ["work_type = ?", 'poetry'])
    @prosers  = @edition.contributors.all(:conditions => ["work_type = ?", 'prose'])
    @reviews  = @edition.works.all(:conditions => "work_type = 'review'")
---
SELECT * FROM `editions` ORDER BY publish_date DESC LIMIT 1
SELECT * FROM `works` WHERE (work_type = 'poetry') AND (`works`.edition_id = 1)