app/controllers/users_controller.rb

SELECT * FROM `users` ORDER BY lastname
---
  def index
    @users  = User.all :order => 'lastname'

INSERT INTO `users` (`salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `firstname`, `lastname`, `writer_type`, `remember_token`, `login`, `group`, `email`, `created_at`) VALUES('ecfefab6db37935ebf6aea46509c24c0b71d8963', '2009-08-05 18:10:51', '05d79b9229d17784fa31eaae4190c475c8ec0f2e', NULL, 'Nick', 'Reavill', NULL, NULL, 'admin', NULL, 'admin@fluxequalsrad.com', '2009-08-05 18:10:51')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `writer_type` = 'Prose', `updated_at` = '2009-08-19 12:25:36' WHERE `id` = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])