app/controllers/works_admin_controller.rb

  def index
    @works = Work.all
---
SELECT * FROM `works`

  def show
    @work = Work.find(params[:id])
---
SELECT * FROM `works` WHERE (`works`.`id` = 1)

  def edit
    @work = Work.find(params[:id])
---
SELECT * FROM `works` WHERE (`works`.`id` = 1)

  def create
    @work = Work.new(params[:work])

    respond_to do |format|
      if @work.save
---
INSERT INTO `works` (`work_content`, `work_type`, `updated_at`, `title`, `abstract`, `edition_id`, `user_id`, `created_at`) VALUES('Lorem ipsum dolor sit amet, consectetur adipiscing elit. Ut ultricies condimentum tortor at semper. Donec urna nibh, varius ut blandit scelerisque, bibendum et libero. Nullam diam sem, posuere in posuere id, aliquam sed risus. In ornare, sem eget varius malesuada, nunc lectus sodales nibh, eget pharetra arcu nunc congue eros. Sed a diam eu purus fringilla sodales. Nunc quam sem, ullamcorper quis porttitor in, elementum nec elit.', 'poetry', '2009-10-08 14:38:44', 'Parboiled', 'What is the plum tart doing on the table?', 1, 1, '2009-10-08 14:38:44')

  def update
    @work = Work.find(params[:id])

    respond_to do |format|
      if @work.update_attributes(params[:work])
---
SELECT * FROM `works` WHERE (`works`.`id` = 1)
UPDATE `works` SET `work_content` = 'Oh such a lovely poem\r\nOh such a lovely poem\r\nOh such a lovely poem\r\nOh such a lovely poem\r\nOh such a lovely poem', `abstract` = 'Lovely poem. It really is so delightful, I\'m not sure if I can stand it.', `updated_at` = '2009-10-08 13:21:13' WHERE `id` = 1