app/controllers/works_controller.rb

  def index
    @works = Work.all
---
SELECT * FROM `works`

  def show
    @work     = Work.find(params[:id])
    @edition  = @work.edition
    @page     = params[:page].to_i

    if !@work.work_pages.none?
---
SELECT * FROM `works` WHERE (`works`.`id` = 1)
SELECT * FROM `editions` WHERE (`editions`.`id` = 1)